RoboMaster/ArduinoCore-imxrt/boards.txt
# The MIT License (MIT)

# Copyright (c) 2019 Seeed Technology Inc.

# Permission is hereby granted, free of charge, to any person obtaining a copy
# of this software and associated documentation files (the "Software"), to deal
# in the Software without restriction, including without limitation the rights
# to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
# copies of the Software, and to permit persons to whom the Software is
# furnished to do so, subject to the following conditions:

# The above copyright notice and this permission notice shall be included in
# all copies or substantial portions of the Software.

# THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
# IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
# FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
# AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
# LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
# OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
# THE SOFTWARE.

menu.flash=Flash
menu.speed=CPU Speed
menu.debug=Debug

# Robomaster Ai Hub
# ------------------------------
rm_ai_hub.name=Robomaster Ai Hub
rm_ai_hub.vid.0=0x2886
rm_ai_hub.pid.0=0x002B
rm_ai_hub.vid.1=0x2886
rm_ai_hub.pid.1=0x802B

rm_ai_hub.upload.tool=rmaut
rm_ai_hub.upload.protocol=sam-ba
rm_ai_hub.upload.maximum_size=8323072
rm_ai_hub.upload.offset=0x10000
rm_ai_hub.upload.use_1200bps_touch=false
rm_ai_hub.upload.wait_for_upload_port=true
rm_ai_hub.upload.native_usb=true

rm_ai_hub.build.mcu=cortex-m7
rm_ai_hub.build.fpu=fpv5-d16
rm_ai_hub.build.f_cpu=600000000L
rm_ai_hub.build.usb_product="Ai Hub"
rm_ai_hub.build.usb_manufacturer="Dji"
#SEEED_ARCH_MIX RM_AI_HUB 这个换了没有印象
rm_ai_hub.build.board=RM_AI_HUB 
rm_ai_hub.build.processor=MIMXRT1064
rm_ai_hub.build.core=arduino
rm_ai_hub.build.extra_flags=-DCPU_MIMXRT1064DVL6A -DSEEED_ARCH_MIX -DXIP_EXTERNAL_FLASH=1 -DXIP_BOOT_HEADER_ENABLE=1 -DUSB_STACK_BM -DARDUINO_MAIN=1 -DSERIAL_PORT_TYPE_UART=1 -DSDK_DEBUGCONSOLE=1 -DMCUXPRESSO_SDK -DDEBUG -g
rm_ai_hub.build.ldscript=MIMXRT1064xxxxx_flexspi_nor.ld
# 决定了varitans文件夹的名称
rm_ai_hub.build.variant=ai_hub 

rm_ai_hub.menu.debug.off=Off
rm_ai_hub.menu.debug.on=On
rm_ai_hub.menu.debug.on.build.flags.debug=-g
rm_ai_hub.menu.speed.600= 600 MHz (standard)
rm_ai_hub.menu.speed.600.build.f_cpu=600000000L
rm_ai_hub.menu.flash.QSPI=QSPI (default)
rm_ai_hub.menu.flash.QSPI.build.flags.flash=-DQSPI_FLASH
rm_ai_hub.menu.flash.Hyper=Hyper
